# Задача 32: Определить индексы элементов массива (списка),
# значения которых принадлежат заданному диапазону (т.е. не меньше заданного минимума и не больше заданного максимума)
# Ввод:  [-5, 9, 0, 3, -1, -2, 1, 4, -2, 10, 2, 0, -9, 8, 10, -9, 0, -5, -5, 7]
# 5
# 15
# Вывод: [1, 9, 13, 14, 19]
#----------------------------

from random import randint
n = int(input('Введите кол-во элементов: '))
min_1 = int(input('Введите нижнюю границу: '))
max_1 = int(input('Введите вкрхнюю границу: '))
list_1 = [randint(-n, n) for i in range(n)]
print(list_1)
for i in range(n):
    if list_1[i] >= min_1 and list_1[i] <= max_1:
        print(f'[{i}]', end=' ')
